Autodesk.Revit.DB.MultiSegmentGrid.GetGridIds
Get the element ids of the Grids that make up this MultiSegmentGrid.
Returns:
Element ids of Grids that make up this MultiSegmentGrid.
Since:
2013

Autodesk.Revit.DB.MultiSegmentGrid.IsValidCurveLoop(Autodesk.Revit.DB.CurveLoop)
Identifies whether the specified curve loop is valid for creation of a MultiSegmentGrid.
curveLoop:
The curve loop.
Returns:
True if the curve loop is an open curve loop consisting of lines and arcs, and false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.MultiSegmentGrid.IsValidSketchPlaneId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies whether provided element id corresponds to a SketchPlane that is valid for GridChain creation.
document:
The document.
elemId:
Element id.
Returns:
True if elemId is the element id of a horizontal SketchPlane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.MultiSegmentGrid.AreGridsInSameMultiSegmentGrid(Autodesk.Revit.DB.Grid,Autodesk.Revit.DB.Grid)
Determine whether two Grids are members of the same GridChain.
grid1:
A Grid.
grid2:
A Grid.
Returns:
Returns true if both of the specified Grids are associated to the same MultiSegmentGrid,
i.e. getMultiSegementGridId returns the same valid element id for both Grids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.MultiSegmentGrid.GetMultiSegementGridId(Autodesk.Revit.DB.Grid)
Retrieve the element id of the MultiSegmentGrid of which the specified Grid is a member.
grid:
A Grid.
Returns:
The element id of the associated GridChain. If the Grid is not associated to a GridChain,
this will return invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.MultiSegmentGrid.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.CurveLoop,Autodesk.Revit.DB.ElementId)
Create a MultiSegmentGrid element from the specified curve loop.
Remarks:
For each curve in the curve loop, a corresponding Grid will be created.
document:
The document in which to create the MultiSegmentGrid.
typeId:
Element id of a GridType element.
curveLoop:
An open curve loop consisting of lines and arcs.
sketchPlaneId:
Element id of a SketchPlane for the curves elements that will be created from the curveLoop.
Returns:
The element id of the new MultiSegmentGrid element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id should refer to a valid horizontal SketchPlane.
-or-
The element id should refer to a GridType element.
-or-
The curve loop should be an open loop consisting of lines and arcs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.MultiSegmentGrid.Text
name shared by grids in this MultiSegmentGrid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.MultiSegmentGrid
This element acts as a multi-segmented Grid. The individual grids associated to
the MultiSegmentGrid behave as a single unit and all share the same text. They inherit
their type (GridType) from the MultiSegmentGrid.
Since:
2013